tunr-app/tunr_app_api/app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "artist", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "L'amour peut etre"], ["artist", "Ricky Hollywood"], ["time", "4:34"], ["created_at", "2020-08-06 16:51:28.947510"], ["updated_at", "2020-08-06 16:51:28.947510"]]

  def update
    if @song.update(song_params)
---
UPDATE "songs" SET "title" = $1, "artist" = $2, "time" = $3, "updated_at" = $4 WHERE "songs"."id" = $5  [["title", "null"], ["artist", "Null"], ["time", "null"], ["updated_at", "2020-08-06 19:19:06.424531"], ["id", 3]]

  def destroy
    @song.destroy
---
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 5]]